/*======================================================================================================================================================= 
Интерфейс:IWebApiControllerHandler
Требования к функционалу обработчика запроса.

 TOut Handle(TIn p); - синхронная реализация обработки запроса TIn - тип параметра запроса   TOut - тип результата обработки запроса
 TOut  Task<TOut> HandleAsync(TIn p); - асинхронная реализация обработки запроса TIn - тип параметра запроса   TOut - тип результата обработки запроса

======================================================================================================================================================= */


namespace ItZnak.Infrastruction.Web.Controllers
{
    public interface IWebApiControllerHandler<TIn, TOut>
    {
        TOut Handle(TIn p);
        Task<TOut> HandleAsync(TIn p);
    }
}